<template>
  <!-- 用户注册协议页面 -->
  <div>
    <van-sticky>
      <van-nav-bar title="用户协议" left-arrow @click-left="onClickLeft" />
    </van-sticky>
    <div class="help-main">
      <h3>会员注册协议</h3>
      <p>您可以通过本平台注册成为本平台的会员(以下称“会员”)。</p>
      <p>
        为了使用本平台的产品及服务(以下称“本服务")，
        在您注册成为本平台会员之前，您应当认真阅读、充分理解并严格遵守会员注册协议(以下称“本协议”)。当您按照本平台的相关页面提示填写信息、阅读本协议,您点击“同意按钮或实际使用本平台或本服务即表示您已阅读并同意本协议的全部内容。
      </p>
      <p>
        如您未满18周岁，请在法定监护人的陪同下阅读本协议,并由您的监护，人代为确认同意接受本协议。如果未成年人未经监护人同意，但隐瞒未成年人身份注册成为本平台会员的,我们将视其为成年人会员。
      </p>
      <p></p>
      1.本协议的主体
      本协议是您与本平台运营方(以下称运营方”)之间，就您使用本服务相关事宜订立的协议。
      2.本服务
      运营方拟向所有本平台会员推出本服务，使所有会员有机会享受各项服务。本服务的内容计划包括但不限于:获得商户最新的产品促销信息、购买商户套餐及商户提供的其他服务。
      3.使用本服务的条件
      使用本服务以您注册成为本平台会员为前提，在您注册成为本平台会员之前，需要先按照相关页面提示填写信息、阅读并同意本协议。在您同意本协议之前，您无法使用本服务。
      4.本平台的更新 为了改善用户体验、完善服务内容,运营方有权更新本平台
      的功能和内容。本平台更新后，如您继续使用本平台，表明您已经同意按照变更后的内容执行。
      5.个人信息保护 (1)隐私政策
      在您使用本平台及本服务的过程中，为了实现本平台的功能并向您提供本服务，运营方会收集、使用您的个人信息。运营方非常重视用户的个人信息的保护。运营方就个人信息的收集、保存及使用等方面的规则及措施，制定了隐私政策(以下称“隐私政策”)。建议您完整地阅读隐私政策,以帮助您更好地保护您的隐私权。您使用本平台及本服务,则视为您同意隐私政策的所有内容。如果您不同意，您应当停止
      使用本平台及本服务。
      (2)本平台及本服务相关个人信息的收集、使用、共享在此特别提醒您，运营方将按照下述内容收集、使用、共享、跨境传输您的个人信息。您使用本平台及本服务,则视为您同意下述所有内容。如果您不同意，您应当停止使用本
      平台及本服务。
      6.信息内容规范本条所述信息内容是指您使用本平台及本服务过程中所产生的包括但不仅限于图片、动画、视频、语音、音乐、文字和附加程序的任何内容，以及其他使用本平台及本服务所产生的内容。您理解并同意,本平台及本服务-
      -直致力于为用户 提供文明健康、规范有序的操作环境，您不得利用本平台及
      本服务制作、复制、发布、传播如下内容。
      (1)违反国家法律法规、危害国家安全统--、社会稳定、公序良俗、社会公德以及侮辱、诽谤、淫秽或含有任何性或性暗示的、暴力的内容;侵害他人名誉权、肖像权、知识产权、商业秘密等合法权利的内容;
      (2)涉及他人隐私、个人信息或资料的内容;(3)骚扰、广告信息及垃圾信息;
      (4)关系到或助长犯罪行为或重大危险行为的内容;
      (5)包含歧视性言论的内容;(6)以选举前的准备活动、选举活动及其他类似行为为目的
      的内容;(7)涉及猥亵、儿童色情、儿童虐待等对未成年人造成不良
      影响的内容;(8)虚假的内容; (9)违反公序良俗或社会公德的内容;
      (10)包含特定的政治3主张或宗教主张的内容;
      (11)以营利行为或宣传行为为目的的内容; (12)妨害本服务正常运营的内容;
      (13)其他违反法律法规、政策或干扰本平台及本服务正常运
      营、或侵犯其他用户或第三方合法权益的内容。 7.本平台使用规范
      除非法律明确允许或运营方事先书面许可，您使用本平台不 得从事下列行为:
      (1)对本平台进行反向工程、反向汇编、反向编译，或者以
      其他方式尝试获取本平台的源代码;
      (2)对运营方拥有知识产权的内容进行使用、出租、出借、
      复制、修改、链接、转载、汇编、发表、出版、建立镜像站 筹;
      (3)对本平台或者本平台运行过程中释放到任何终端内存中
      的数据、本平台运行过程中客户端与服务器端的交互数据,
      以及本平台运行所必需的系统数据，进行复制、修改、增
      加、删除、挂接运行或创作任何衍生作品，形式包括但不限
      于使用插件、外挂或非经运营方授权的第三方工具服务接 入本平台和相关系统;
      (4)通过未经运营方授权的任何方式修改或伪造本平台运行
      中的指令、数据,增加、删减、变动本平台的功能或运行效
      果，或者将用于上述用途的软件、方法进行运营或向公众传
      播,无论这些行为是否为商业目的;
      (5)通过非运营方开发、授权的第三方软件、插件、外挂、
      系统，登录或使用本平台及本服务，或制作、发布、传播上 述工具;
      (6)自行或者授权他人、第三方软件对本平台及其组件、模
      块、数据进行干扰，或制作、发布、使用、传播用于窃取本 平台的恶意程序;
      (7)其他未经运营方事先明示授权的行为。 8.服务运营规范
      除非法律明确允许或运营方事先书面许可，您使用本服务过 程中不得从事下列行为:
      (1)本人或诱导其他用户以任何方式影响到本服务正常操 作、使用;
      (2)虚构事实、隐瞒真相以误导、欺骗他人;
      (3)侵害他人名誉权、肖像权、知识产权、商业秘密等合法 权利;
      (4)未经运营方书面许可，利用本服务或任何功能进行推 广;
      (5)利用本平台或服务从事任何违法犯罪活动的;
      (6)制作、发布与以上行为相关的方法、工具，或对此类方
      法、工具进行运营或传播,无论这些行为是否为商业目的;
      (7)其他违反法律法规规定、侵犯其他用户合法权益、干扰
      产品正常运营或运营方未明示授权的行为。
    </div>
  </div>
</template>
<style lang="stylus" scoped></style>
<script>
export default {
  methods: {
    onClickLeft() {
      this.$router.go(-1);
    },
  },
};
</script>
<style lang="stylus" scoped>
.van-nav-bar {
  background: $bgColor;

  /* /deep/ 就是把data-v-hash值选择器写到类名的前面 */
  /deep/ .van-nav-bar__title, /deep/ .van-icon {
    color: #fff;
  }
}

.help-main {
  font-size: 12px;
  color: #454545;
  padding: 14px 14px 0;
  line-height: 18px;
  font-weight: bold;

  h3 {
    font-size: 20px;
    height: 50px;
    line-height: 50px;
    text-align: center;
  }

  p {
    margin: .06rem 0;

  }
}
</style>
